Revit 2027 API
Connector.AssignedPipeFlowConfiguration Property
The pipe flow configuration type of the connector.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public PipeFlowConfigurationType AssignedPipeFlowConfiguration { get; }
Public ReadOnly Property AssignedPipeFlowConfiguration As PipeFlowConfigurationType
	Get
public:
property PipeFlowConfigurationType AssignedPipeFlowConfiguration {
	PipeFlowConfigurationType get ();
}
member AssignedPipeFlowConfiguration : PipeFlowConfigurationType with get
Property Value
PipeFlowConfigurationType
Exceptions
Exception | Condition
InvalidOperationException |  Thrown when the connector's domain is not DomainPiping. Thrown when the connector is not in a family instance.
InvalidOperationException |  Thrown on failure to get pipe flow configuration.
Remarks
Assigned pipe flow configuration may be assigned for connectors of some family instances.
See Also
Reference
Connector Class
Autodesk.Revit.DB Namespace